#define _CRT_SECURE_NO_WARNINGS 1  
#include<stdio.h>
#include<assert.h>
/************************************* 打印一个整数的每一位**************************************************/

// void Print_bit(int num)
//{
//	if(num>9)//两位数以上进行递归 
//	{
//		Print_bit(num/10);
//	}
//	printf("%d ", num % 10);//直至一位数时打印
//
//}
//int main()
//{
//	printf("请输入要打印的数：\n");
//	scanf("%d", &num);
//	int num = 0;
//	Print_bit(num);
//	return 0;
//}

/************************************* n的阶乘（不考虑溢出的问题）*******************************************/

//int Factorial1(int n)//非递归法
//{
//	assert(n > 0);//负数没有阶乘
//	int res = 1;
//	for (int i = n; i > 1; --i)
//	{
//		res *= i;
//	}
//	return res;
//}
//
//int Factorial2(int n)//递归法
//{
//	assert(n > 0);//负数没有阶乘
//	if (n <=1)//0和1的阶乘为1
//	{
//		return 1;
//	}
//	else
//	{
//		return n*Factorial(n - 1);//大于1的进行递归
//	}
//}
//int main()
//{
//	
//	int n = 0,Res = 0;
//	printf("请输入要计算的数阶乘：\n");
//	scanf("%d", &n);   // n超过12就会溢出
//	Res=Factorial1(n);
//	printf("Res=%d\n", Res);
//	return 0;
//}


/************************************* my_strlen *************************************************************/

int mian()
{
	return 0;
}

/************************************* 字符串逆序 ************************************************************/


/************************************* 计算一个数的每位之和 **************************************************/


/************************************* 递归实现n的k次方 ******************************************************/


/************************************* 计算斐波那契数 ********************************************************/